; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v13 ?v1)
             (pred_7 ?v12 ?v5)
             (pred_8 ?v13 ?v5)
             (pred_12 ?v11 ?v13 )
	     (pred_4 ?v13)
             (pred_11 ?v2)
             (pred_2 ?v12)
             (pred_10 ?v5)
             (pred_3 ?v13)
             (pred_1 ?v12)
             (pred_5 ?v13)
             (pred_9 ))



(:action op_4
:parameters (?v8 ?v9 ?v4 ?v6)
:precondition (and (pred_11 ?v8) (pred_11 ?v9) (pred_2 ?v4) (pred_10 ?v6)
          (pred_6 ?v8 ?v9) (pred_7 ?v4 ?v6)
                   (pred_8 ?v9 ?v6) (pred_4 ?v8) 
                   (pred_3 ?v9) (pred_1 ?v4))
:effect (and  (pred_5 ?v9) (not (pred_3 ?v9))))


(:action op_5
:parameters (?v8 ?v10)
:precondition (and (pred_11 ?v8) (pred_11 ?v10)
               (pred_4 ?v8) (pred_6 ?v8 ?v10) (pred_5 ?v10))
:effect (and (pred_4 ?v10) (not (pred_4 ?v8))))

(:action op_1
:parameters (?v8 ?v4)
:precondition (and (pred_11 ?v8) (pred_2 ?v4) 
                  (pred_4 ?v8) (pred_12 ?v4 ?v8) (pred_9 ))
:effect (and (pred_1 ?v4)
   (not (pred_12 ?v4 ?v8)) (not (pred_9 ))))


(:action op_3
:parameters (?v8 ?v7 ?v3)
:precondition (and (pred_11 ?v8) (pred_2 ?v7) (pred_2 ?v3)
                  (pred_4 ?v8) (pred_1 ?v3) (pred_12 ?v7 ?v8))
:effect (and (pred_1 ?v7) (pred_12 ?v3 ?v8)
        (not (pred_1 ?v3)) (not (pred_12 ?v7 ?v8))))

(:action op_2
:parameters (?v8 ?v4)
:precondition (and (pred_11 ?v8) (pred_2 ?v4) 
                  (pred_4 ?v8) (pred_1 ?v4))
:effect (and (pred_9 ) (pred_12 ?v4 ?v8) (not (pred_1 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_15 obj_20 obj_14 obj_07 obj_09 obj_17 obj_18 obj_06 obj_04 obj_08 obj_02 obj_05 obj_03 obj_19 obj_12
    obj_16 obj_01
    obj_13 obj_21 obj_10
    )

    (:init
       (pred_9)

       (pred_11 obj_11)
       (pred_11 obj_15)
       (pred_11 obj_20)
       (pred_11 obj_14)
       (pred_11 obj_07)
       (pred_11 obj_09)
       (pred_11 obj_17)
       (pred_11 obj_18)
       (pred_11 obj_06)
       (pred_11 obj_04)
       (pred_11 obj_08)
       (pred_11 obj_02)
       (pred_11 obj_05)
       (pred_11 obj_03)
       (pred_11 obj_19)
       (pred_11 obj_12)
       (pred_10 obj_16)
       (pred_10 obj_01)
       (pred_2 obj_13)
       (pred_2 obj_21)
       (pred_2 obj_10)

       (pred_6 obj_11 obj_07)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_15 obj_09)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_20 obj_17)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_20 obj_15)
       (pred_6 obj_14 obj_18)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_07 obj_06)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_07 obj_11)
       (pred_6 obj_09 obj_04)
       (pred_6 obj_09 obj_17)
       (pred_6 obj_09 obj_15)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_17 obj_08)
       (pred_6 obj_17 obj_18)
       (pred_6 obj_17 obj_20)
       (pred_6 obj_17 obj_09)
       (pred_6 obj_18 obj_02)
       (pred_6 obj_18 obj_14)
       (pred_6 obj_18 obj_17)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_06 obj_04)
       (pred_6 obj_06 obj_07)
       (pred_6 obj_04 obj_03)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_04 obj_06)
       (pred_6 obj_08 obj_19)
       (pred_6 obj_08 obj_02)
       (pred_6 obj_08 obj_17)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_02 obj_12)
       (pred_6 obj_02 obj_18)
       (pred_6 obj_02 obj_08)
       (pred_6 obj_05 obj_03)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_03 obj_19)
       (pred_6 obj_03 obj_04)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_08)
       (pred_6 obj_19 obj_03)
       (pred_6 obj_12 obj_02)
       (pred_6 obj_12 obj_19)
       (pred_3 obj_06)
       (pred_3 obj_14)
       (pred_3 obj_09)
       (pred_8  obj_06 obj_16)
       (pred_8  obj_14 obj_01)
       (pred_8  obj_09 obj_16)
       (pred_5 obj_11)
       (pred_5 obj_15)
       (pred_5 obj_20)
       (pred_5 obj_07)
       (pred_5 obj_17)
       (pred_5 obj_18)
       (pred_5 obj_04)
       (pred_5 obj_08)
       (pred_5 obj_02)
       (pred_5 obj_05)
       (pred_5 obj_03)
       (pred_5 obj_19)
       (pred_5 obj_12)

       (pred_7  obj_13 obj_16)
       (pred_7  obj_21 obj_01)
       (pred_7  obj_10 obj_01)
       (pred_12 obj_13 obj_08)
       (pred_12 obj_21 obj_04)
       (pred_12 obj_10 obj_03)
       (pred_4 obj_03)
    )

    (:goal (and
       (pred_12 obj_13 obj_12)
    ))
(:constraints
  (always (not (pred_4 obj_19)))
)
)

; plan
1. (op_5 obj_03 obj_04)
   deleted: (pred_4 obj_03)
   added: (pred_4 obj_04)
   goals met: 0 of 1
2. (op_5 obj_04 obj_08)
   deleted: (pred_4 obj_04)
   added: (pred_4 obj_08)
   goals met: 0 of 1
3. (op_1 obj_08 obj_13)
   deleted: (pred_12 obj_13 obj_08) (pred_9)
   added: (pred_1 obj_13)
   goals met: 0 of 1
4. (op_5 obj_08 obj_02)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_02)
   goals met: 0 of 1
5. (op_5 obj_02 obj_12)
   deleted: (pred_4 obj_02)
   added: (pred_4 obj_12)
   goals met: 0 of 1
6. (op_2 obj_12 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_9) (pred_12 obj_13 obj_12)
   goals met: 1 of 1
